      ******************************************************************
      * Author:
      * Date:
      * Purpose:
      * Tectonics: cobc
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. YOUR-PROGRAM-NAME.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 tenxs COMP-1.
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
           SET tenxs TO 10.0.
            DISPLAY "X(10)"
            DISPLAY tenxs UPON Console
            STOP RUN.
       END PROGRAM YOUR-PROGRAM-NAME.
