      ******************************************************************
      * Author:
      * Date:
      * Purpose:
      * Tectonics: cobc
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. YOUR-PROGRAM-NAME.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
           01 ten COMP-1.
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
           SET ten TO 10.
           DISPLAY ten UPON Console
           STOP RUN.
       END PROGRAM YOUR-PROGRAM-NAME.
